fsiScript/templateMesh/fluidMeshing/0/WallThickness
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2412                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       pointScalarField;
    location    "0";
    object      WallThickness;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
189222
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    outerWall
    {
        type            calculated;
    }
    wall
    {
        type            calculated;
    }
    auto1
    {
        type            calculated;
    }
    auto2
    {
        type            calculated;
    }
    auto3
    {
        type            calculated;
    }
    auto4
    {
        type            calculated;
    }
    auto5
    {
        type            calculated;
    }
    auto6
    {
        type            calculated;
    }
    auto7
    {
        type            calculated;
    }
    auto8
    {
        type            calculated;
    }
    auto9
    {
        type            calculated;
    }
    auto10
    {
        type            calculated;
    }
    inlet
    {
        type            calculated;
    }
    auto12
    {
        type            calculated;
    }
}


// ************************************************************************* //
