fsiScript/templateMesh/fluidMeshing/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //



dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.01;

boundaryField
{
   processor
    {
      type processor;
    }

   inlet
     {
    type            turbulentIntensityKineticEnergyInlet;
        intensity           0.01;
	value uniform  0;
     }
    "auto.*"
    {
        type            zeroGradient;
    }

    wall
    {
        type            fixedValue;
        value           uniform 0;
    }


}


// ************************************************************************* //
