fsiScript/templateMesh/fluidMeshing/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
  processor
    {
      type processor;
    }
  inlet
    {
      type calculated;
      value uniform 0;
    }
  
  wall
    {
      type fixedValue;
      value uniform 0;
    }

    "auto.*"
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
