fsiScript/templateMesh/fluidMeshing/system/fvSolution

/*--------------------------------*- C++ -*----------------------------------* \
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-06;
        relTol          0;
	verbose          false;
    }

    pFinal
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|k|omega|kl)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-06;
        relTol          0;
    }

     UFinal
     {
         $U;
         tolerance       1e-06;
         relTol          0;
     }

         Phi
     {
         tolerance       1e-04;
        relTol          0;
     }
	 
     
          omegaFinal
      {
        solver          smoothSolver;
        smoother        symGaussSeidel;
	tolerance       1e-06;
          relTol          0;
      }
	  
	  kFinal
	  {
        solver          smoothSolver;
        smoother        symGaussSeidel;
	tolerance       1e-06;
          relTol          0;
      }
	  
     ktFinal
     {
        solver          smoothSolver;
        smoother        symGaussSeidel;
	tolerance       1e-06;
          relTol          0;
      }

     Phi
     {
         tolerance       1e-04;
         relTol          0;
     }

}

PIMPLE
{
    nOuterCorrectors 200;
    nCorrectors     3;
    nNonOrthogonalCorrectors 3;
    pRefCell        0;
    pRefValue       0;

    residualControl
      {
	U
	  {
	    tolerance 1e-6;
	    relTol    0;
	  }
	p
	  {
	    tolerance 1e-6;
	    relTol    0;
	  }
      }
}

SIMPLE
{
    nNonOrthogonalCorrectors 0;
    residualControl
    {
        p               1e-2;
        U               1e-3;
        "(k|epsilon)"   1e-3;
    }
}

relaxationFactors
{
    fields
    {
      p                 0.3;//0.7;
	pFinal          1;
    }
    equations
    {
        U               0.7;
        kt               0.7;
        omega     0.7;
	kl        0.7;
    }
}

cache
{
    grad(U);
}

potentialFlow
{
  nNonOrthogonalCorrectors 10;
}

// ************************************************************************* //
