fsiScript/templateMesh/fluidMeshing/system/inletP

type surfaceFieldValue;
libs (fieldFunctionObjects);

enabled true;

writeFields false;
log true;
regionType patch;
name inlet;
operation areaAverage;
fields (p);
