fsiScript/templateMesh/fluidMeshing/system/outflowPatch

type surfaceFieldValue;
libs (fieldFunctionObjects);
writeControl writeTime;
writeFields false;

regionType patch;
name auto11;
operation sum;

fields  (phi);

