fsiScript/templateMesh/fluidMeshing/system/pressureProbes
       type probes;
       libs ("libsampling.so");
       
       writeControl timeStep;
       writeInterval 1;
       
       fields (p);
       probeLocations
	 (
	  (-0.025 0.025 0.09) MPA
	  (-0.0485 -0.0274 0.05406) LPA
	  (0.05798 -0.0334786 0.0306384) RPA
	  
	  );

